import sys
input = sys.stdin.readline
# 이 문제는 dfs가 효율적인가 빡구현이 효율적인가.. 형이 일단 구현문제라고 해서 빡구현 해벌임..
shape = [# 좌표는 변하면 안되니까 튜플로 저 -> 이 좌표들을 규칙성을 가지고 반복문으로 생성할 방법은 없을까?
    # 사각형
    [(0, 1), (1, 0), (1, 1)],
    # 일자 모양
    [(0, 1), (0, 2), (0, 3)],
    [(1, 0), (2, 0), (3, 0)],
    # ㄴ 모양
    [(1, 0), (2, 0), (2, 1)],
    [(1, 0), (2, 0), (2, -1)],
    [(1, 0), (1, 1), (1, 2)],
    [(0, 1), (1, 0), (2, 0)],
    # ㄱ 모양
    [(0, 1), (0, 2), (1, 0)],
    [(0, 1), (0, 2), (-1, 2)],
    [(0, 1), (1, 1), (2, 1)],
    [(1, 0), (1, 1), (2, 1)],
    # ㅜ 모양
    [(0, 1), (0, 2), (1, 1)],
    [(1, 0), (1, 1), (2, 0)],
    [(0, 1), (0, 2), (-1, 1)],
    [(1, 0), (1, -1), (2, 0)],
    # 용가리 모양
    [(0, 1), (0, 2), (1, 2)],
    [(1, 0), (1, -1), (2, -1)],
    [(0, 1), (1, 1), (1, 2)],
    [(0, 1), (1, 0), (1, -1)],
    [(0, 1), (1, 1), (1, 0)],
    [(0, 1), (1, 1), (-1, 1)]
]

n,m = map(int,input().split())
arr = [list(map(int,input().split())) for i in range(n)]

def find(x, y):
    for i in range(len(shape)):
        result = arr[x][y]
        for dx, dy in shape[i]:
            if 0 <= x + dx < n and 0 <= y + dy < m:
                result += arr[x + dx][y + dy]
                continue
            break
        else:
            answer.add(result)

answer = set()

for i in range(n):
    for j in range(m):
        find(i, j) # 4중 for문은 보기가 안좋아서 메소드화..

print(max(answer))